[
  {
    "title":"Context menu",
    "body":"<p>Реализовать контекстное меню:</p><ol>Требования:<li>Первый аргумент - узел на котором будет работать контекстное меню;</li><li>Второй аргумент - описание структуры меню. Пример описания прикладывается.Структура может быть любой по вложенности и количеству элементов меню. (рекурсивно генерировать DOM будет ок);</li><li>Подменю может содержать вложенные подменю;</li><li>При правом клике по узлу, для которого было создано ContextMenu показывать меню прямо под местом клика;</li><li>При клике по пункту меню должна выполняться соответствующая функция;</li><li>Каждый элемент, содержащий подменю, должен быть отмечен «>» символом;</li><li>Подменю открывается при наведении на пункт подменю, и закрывается при уходемышки с подменю или пункта подменю (смотри события mouseenter и mouseleave);</li><li>С позиционированием (чтобы все меню и подменю вмещались в видимую часть экрана) можно не заморачиваться;</li><li>Стилизовать меню можно на свой вкус (главное - видимые границы элементов).</li></ol><code>var menuExample = [{<br>&emsp;title: 'File',<br>&emsp;action: function () {console.log('open file')}<br>}, {<br>&emsp;title: 'Edit',<br>&emsp;action: function () {console.log('edit content')}<br>}, {<br>&emsp;title: 'More stuff',<br>&emsp;submenu: [{<br>&emsp;title: 'Send by email',<br>&emsp;action: function () {console.log('emailed')}<br>}, {<br>&emsp;title: 'Send via skype',<br>&emsp;action: function () {console.log('skyped')}<br>}]<br>}]</code>",
    "source":"homework/ContextMenu/ContextMenu.html"
  },
  {
    "title":"Stopwatch",
    "body":"<p>Реализовать виджет «секундомер»:</p><ol>Требования:<li>Кнопки «стоп», «старт» (одна и та же кнопка), «сброс», «круг»;</li><li>Секундомер работает с точностью до миллисекунд;</li><li>Когда он запущен, показывается время в формате чч:мм:сс:мс;</li><li>Нажатие на кнопку «стоп» останавливает ход секундомера;</li><li>Кнопка «круг» добавляет текущее значение секундомера в список результатов;</li><li>Элементы из списка результатов можно удалять поштучно;</li><li>Кнопка «сброс» останавливает секундомер, если тот бежит, сбрасывает значение в нули, убирает все результаты, если такие есть. «Круг» работает одинаково для остановленного и запущенного секундомеров.</li><li>Управление с клавиатуры (проверь, чтобы работало в разных расскладках): «s» - start/stop, «l» - lap, «r» - reset. Если на странице несколько секундомеров, с клавиатуры управляется тот, над последним из которых находилась мышка.</li></ol>",
    "source":"homework/Stopwatch/Stopwatch.html"
  },
  {
    "title":"Form validation",
    "body":"<p>Релизовать валидацию формы.</p><p>Валидировать поля формы надо в процессе набора (но не показывать ошибки до того, как пользователь что-то ввел). Форму нельзя мочь отправить, если есть ошибки. Если показаны ошибки, кнопка отправки формы должна быть неактивной (код неактивной кнопки закомментирован). Поля, обязательные к заполнению помечены звездочками.</p><p>Поля с ошибкой должны подсвечиваться должным образом.</p><p>Все регулярки должны быть написаны самостоятельно.</p><p>Для каждой ошибочной ситуации придумать и выводить поясняющее сообщение. Из сообщения должно быть ясно в чем проблема. Варианты («что-то не так») не использовать.</p><p>Решение должно работать в IE9+.</p><ol>Возможные ошибочные ситуации:<li>Поле, обязательное к заполнению не заполнено;</li><li>Ошибка в email-е;</li><li>email уже занят (сверяться со статическим списком email-ов, который хоранится на глобальном уровне в переменной usedEmails)['author@mail.com', 'foo@mail.com', 'tester@mail.com'];</li><li>Пароль слишком короток (до 5 символов);</li><li>Простой пароль (только числа, только буквы);</li><li>Пароль содержит запрещенные символы (разрешенные - латинские буквы, цифры, подчеркивание, минус);</li><li>Международный формат записи телефона не выдержан;</li><li>Галочка «Согласен со всем» не поставлена.</li></ol>",
    "source":"homework/FormValidation/formValidation.html"
  },
  {
    "title":"Slider",
    "body":"<p>Реализовать виджет «слайдер»:</p><ol>Требования:<li>Слайдер состоит из фиксированного количества слайдов (4шт), изображения имеют одинаковый заранее известный размер. Переход между слайдами анимирован. При клике на плашку слева происходит переход к соответствующему слайдеру, соответствие определяется порядком. Верхняя плашка - первый слайд, вторая сверху - второй, и т.д.;</li><li>Сразу же после инициализации у слайдера включается режим автопрокрутки: показ следующего слайда каждые 2 секунды. Если пользователь кликнул на одну из плашек, перейдя к слайду, автопрокрутку нужно отключить. Автопрокрутку нужно включать через 5 секунд после последнего клика пользователя по плашке. Автопрокрутка циклическая: с последнего слайда происходит переход к первому. На странице можно разместить несколько слайдеров;</li><li>Слайдер подразумевает всегда 4 штуки изображений;</li><li>Использовать возможности jQuery по максимуму;</li><li>Слайдер должен работать в IE9+;</li><li>Никаких готовых плагинов, только самописный код.</li></ol>",
    "source":"homework/Slider/slider.html"
  },
  {
    "title":"List of tags",
    "body":"<p>Реализовать список тегов:</p><ol>Требования:<li>Может переключаться из режима «редактирования» в режим «просмотра». Для переключения используется 1 кнопка. Кнопка меняет свой текст в зависимости от режима;</li><li>Список тегов может быть инициализирован с предопределенным списком тегов, который передается опциональным аргументом;</li><li>В режиме просмотра теги выглядят как список тегов (каждый - колбаской). На странице должно мочь быть сколько угодно списков тегов;</li><li>В режиме редактирования теги можно удалять (рядом с тегами появляется крестик удаления, при клике на который тег удаляется из списка);</li><li>В режиме редактирования теги можно добавлять. Для этого используется инпут с кнопкой. После добавления тега (при клике на кнопку или по enter, при фокусе в инпуте) инпут очищается. Добавить уже добавленный тег нельзя. Пробелы с концов строки не должны влиять на тег (\" mama \" и \"mama\" считается одним и тем же тегом, добавляется в список \"mama\");</li><li>Опционально - добавить кнопку удаления всех тегов.</li></ol>",
    "source":"homework/TagList/tagList.html"
  },
  {
    "title":"ThePortfolio",
    "source":"homework/ThePortfolio/index.html"
  },
  {
    "title":"myTweetz",
    "source":"homework/myTweetz/index.html"
  }
]

